In [2]:
import pandas as pd
import numpy as np

In [13]:
df = pd.read_csv('../notebook/sample_data.csv',index_col=0)

In [14]:
df.loc['Niko']

state        TX
color     green
food       Lamb
age           2
height       70
score       8.3
Name: Niko, dtype: object

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, Jane to Cornelia
Data columns (total 6 columns):
state     7 non-null object
color     7 non-null object
food      7 non-null object
age       7 non-null int64
height    7 non-null int64
score     7 non-null float64
dtypes: float64(1), int64(2), object(3)
memory usage: 712.0+ bytes

In [18]:
df.values

array([['NY', 'blue', 'Steak', 30, 165, 4.6],
       ['TX', 'green', 'Lamb', 2, 70, 8.3],
       ['FL', 'red', 'Mango', 12, 120, 9.0],
       ['AL', 'white', 'Apple', 4, 80, 3.3],
       ['AK', 'gray', 'Cheese', 32, 180, 1.8],
       ['TX', 'black', 'Melon', 33, 172, 9.5],
       ['TX', 'red', 'Beans', 69, 150, 2.2]], dtype=object)

In [20]:
df[['food','state']]

             food state
Jane        Steak    NY
Niko         Lamb    TX
Aaron       Mango    FL
Penelope    Apple    AL
Dean       Cheese    AK
Christina   Melon    TX
Cornelia    Beans    TX

In [28]:
df[['height','color','score']]

           height  color  score
Jane          165   blue    4.6
Niko           70  green    8.3
Aaron         120    red    9.0
Penelope       80  white    3.3
Dean          180   gray    1.8
Christina     172  black    9.5
Cornelia      150    red    2.2

In [30]:
np.max(df[['height','color','score']],axis=0)

height      180
color     white
score       9.5
dtype: object

In [56]:
df.loc['Dean',['age','state']]

age      32
state    AK
Name: Dean, dtype: object

In [57]:
df.loc['Niko':'Dean','age']

Niko         2
Aaron       12
Penelope     4
Dean        32
Name: age, dtype: int64

In [58]:
np.max(df.loc['Niko':'Dean','age'])

32

In [59]:
df.loc[:'Dean','height':]

          height  score
Jane         165    4.6
Niko          70    8.3
Aaron        120    9.0
Penelope      80    3.3
Dean         180    1.8

In [60]:
df.loc[: ,['height','age']]

           height  age
Jane          165   30
Niko           70    2
Aaron         120   12
Penelope       80    4
Dean          180   32
Christina     172   33
Cornelia      150   69

In [63]:
df = pd.read_csv('../notebook/sample_data.csv',index_col=0)
df.index

Index(['Jane', 'Niko', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'], dtype='object')

In [64]:
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [67]:
food = df['food']

In [69]:
food

Jane          Steak
Niko           Lamb
Aaron         Mango
Penelope      Apple
Dean         Cheese
Christina     Melon
Cornelia      Beans
Name: food, dtype: object